Repository: devravindu/SriLankanTaxCalculator
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: si, ta

source: Sri Lankan Tax Calculator
si: ශ්‍රී ලංකා බදු ගණක යන්ත්‍රය
ta: இலங்கை வரி கணிப்பான்

source: Earner Type
si: ආදායම් ලබන්නාගේ වර්ගය
ta: வருமானம் பெறுபவரின் வகை

source: Local (LKR)
si: දේශීය (රු.)
ta: உள்ளூர் (ரூ.)

source: Foreign (USD)
si: විදේශීය (ඇ.ඩො.)
ta: வெளிநாட்டு (US$)

source: Monthly Income
si: මාසික ආදායම
ta: மாதாந்த வருமானம்

source: Please enter a valid monthly income.
si: වලංගු මාසික ආදායමක් ඇතුළත් කරන්න.
ta: சரியான மாதாந்த வருமானத்தை உள்ளிடவும்.

source: Exchange Rate (USD to LKR)
si: විනිමය අනුපාතය (ඇ.ඩො. සිට රු.)
ta: பரிமாற்ற விகிதம் (US$ முதல் ரூ. வரை)

source: Current rate: 1 USD = 320 LKR (default)
si: වර්තමාන අනුපාතය: ඇ.ඩො. 1 = රු. 320 (පෙරනිමි)
ta: தற்போதைய விகிதம்: 1 US$ = ரூ. 320 (இயல்புநிலை)

source: Calculate Tax
si: බදු ගණනය කරන්න
ta: வரியை கணக்கிடு

source: Tax Calculation Results
si: බදු ගණනය කිරීමේ ප්‍රතිඵල
ta: வரி கணக்கீட்டு முடிவுகள்

source: Monthly Income:
si: මාසික ආදායම:
ta: மாதாந்த வருமானம்:

source: Annual Income:
si: වාර්ෂික ආදායම:
ta: வருடாந்த வருமானம்:

source: Monthly Tax:
si: මාසික බද්ද:
ta: மாதாந்த வரி:

source: Annual Tax:
si: වාර්ෂික බද්ද:
ta: வருடாந்த வரி:

source: Generate PDF Report
si: PDF වාර්තාව ජනනය කරන්න
ta: PDF அறிக்கையை உருவாக்கு

source: No data provided
si: දත්ත සපයා නැත
ta: தரவு வழங்கப்படவில்லை

source: Monthly income cannot be negative
si: මාසික ආදායම සෘණ විය නොහැක
ta: மாதாந்த வருமானம் எதிர்மறையாக இருக்க முடியாது

source: Invalid earner type
si: වලංගු නොවන ආදායම් ලබන්නා වර්ගයකි
ta: தவறான வருமானம் பெறுபவர் வகை

source: Exchange rate must be positive
si: විනිමය අනුපාතය ධන විය යුතුය
ta: பரிமாற்ற விகிதம் நேர்மறையாக இருக்க வேண்டும்

source: Invalid numeric input
si: වලංගු නොවන සංඛ්‍යාත්මක ආදානයකි
ta: தவறான எண் உள்ளீடு

source: An error occurred while calculating tax
si: බදු ගණනය කිරීමේදී දෝෂයක් ඇති විය
ta: வரி கணக்கிடும்போது பிழை ஏற்பட்டது
